{
  "dd": [
    {
      "text": "Omg where do I start. Well there is tons of space. It was a group of 16 and we still had a lot of space to be comfy. It is a beautiful home. Brooke was amazing. I had trouble with the tv and I texted her late and she responded!!! She walked me through what I needed to do and the problem was solved. Overall everything was amazing. We would definitely come back.",
      "author": "Toneshia",
      "role": "Client"
    },
    {
      "text": "For our Vegas wedding we invited our family to stay with us at D&D mansion for 3 nights. We arrived at the mansion the day before our wedding, and the sight alone blew us away. True to it's pictures, the rooms are gorgeous and spacious. We opted to pay a bit extra to warm the pool - and we're so glad we did! We were able to use both the Jacuzzi and main pool late into the night, even as Vegas cooled to the low 60's. The kitchen was large enough for all of my aunties to make our traditional dishes AND house all of our wine and water. The driveway was large enough to hold several cars (I think we got up to 8 or so). We even had a Yoga instructor give a class in the morning, by the pool and got to stretch until our heart's were content while listening to the fountain and pool in the background. The team checked in with us throughout the weekend simple to ask if anything was going well. They were kind and friendly, not intrusive at all. The layout was beautiful enough for our wedding pictures. We were able to take photos right in the backyard: We took pics by the koi pond, the old school/James Bond looking car in the back, and inside the house. Our pictures are gorgeous! If you're looking for somewhere to host a large group with no issues at all, then I'd highly recommend D&D mansion.",
      "author": "Chant'l",
      "role": "Client"
    },
    {
      "text": "just perfect retreat. incredible setting, the warmest of welcomes and beautifully clean. What a lovely 3 nights we have had. Highly recommend.",
      "author": "Hanna S",
      "role": "Client"
    },
    {
      "text": "This may come out as an unusual type of testimonial but there are several observations from my visit to D&D which stand out.... the finish work below the waterline of the main pool is EXCEPTIONAL! As an underwater fine art photographer, I truly appreciated the thoughtfulness of the pool design that included even below the surface decoration in the pool. Even the GARAGE is comfortable! The inclusion of that space with all the gear need to shoot underwater made a perfect staging area for what I was doing. Grateful to Total Max for making it available to me! There are some very special places and lighting available at different times around the property. I was there for almost a week and didn't get even half the possibilities explored!Kudos to Total Max Homes on their D&D property. Well worth the visit!",
      "author": "R. Scott Anderson",
      "role": "Client"
    },
    {
      "text": "D&D definitely is the best place to stay in LV.",
      "author": "Jennifer Wu",
      "role": "Client"
    },
    {
      "text": "We had a great time here. It's a great place for family gatherings or corporate events. The kids loved playing in the pools. Great location, not too far from the strip.",
      "author": "Cheryl S.",
      "role": "Client"
    },
    {
      "text": "We came in expecting a good time, we left with a wonderful time. What a place! So much luxury and fun to enjoy, even a full gym with 900 lbs of pro weights. The pool is amazing with even a swim up bar under Palapa. What a place. We will definitely come back again.",
      "author": "VRconnection Guest",
      "role": "Client"
    },
    {
      "text": "We came in expecting a good time, we left with a wonderful time. What a place! So much luxury and fun to enjoy, even a full gym with 900 lbs of pro weights. The pool is amazing with even a swim up bar under Palapa. What a place. We will definitely come back again.",
      "author": "Olivia Jackson",
      "role": "Client"
    },
    {
      "text": "I have been coming to Vegas since I was 18. I have never seen or stayed at a place like the DD mansion. I, my BF Todd and our friends had the best time in the huge resort pool like at any big strip hotels, but all to ourselves. What a wonderful birthday gift from my boy friend! Thank you, Todd, I love you. Now hope we have more times at DD mansion, just the two of us next time. LOL",
      "author": "Shira Smith",
      "role": "Client"
    },
    {
      "text": "This is a wild place with so much stuff. We walked in and saw the blue sky and all the Italian designs, we thought we were at Venice or Rome, or in Caesars place. All those marble statues and indoor waterfall are amazing for a mansion. The price was so good per person we will always book this place each time we are in town now. Of course if I come by myself, I would not do it. Hehe. As it sleeps 39 people with 12 bedrooms.",
      "author": "Aaron Douglas",
      "role": "Client"
    },
    {
      "text": "Our family and friends traveled many times to Vegas, never have we imagined there is a place like the DD mansion. Our whole family, especially the kids had such a fun time there. The pools are amazing. The Chinese Garden is just so Zen to us adults. As we are from Hong Kong, this is a place to be for us Chinese to enjoy both the Vegas fun and tranquility at the same time. We are telling our friends and none of them believed us. DD is a seeing is believing kind of place!",
      "author": "David Franklin",
      "role": "Client"
    },
    {
      "text": "This mansion is incredible!!! Our whole group was a bit shocked as how great this was. I am so glad I was the one that booked this place which looks amazing when you walk onto the place. Our group of 20 people had a great week here as we attended our annual gathering at the SEMA exhibition. We will definitely be back next year and we recommend this place to anyone that comes for a conference or exhibition in Vegas.",
      "author": "Anonymous",
      "role": "Client"
    },
    {
      "text": "We stayed at the Mansion for a Company Convention. We had almost 30 people staying with us and we all fit comfortably. The kitchen and pool area was the main hangout locations. There were also two areas with large table that our group could sit at and talk business. It's very private and gated. Nice retreat and great for large groups. Thank you again for your prompt responses to our questions and your fabulous hospitality. We will come back and stay again at the Mansion",
      "author": "Brittni",
      "role": "Client"
    },
    {
      "text": "This is the best place to stay in Vegas, period!",
      "author": "Param",
      "role": "Client"
    },
    {
      "text": "Vegas could possibly need. The rooms and amenities are outstanding and the proximity to everything you need to see or do is excellent.",
      "author": "Caitlyn",
      "role": "Client"
    },
    {
      "text": "Like a flare over a darkened sea, the D&D Mansion lit up the night sky in this sleepy side-neighborhood off of the Strip. The gated grounds seemed to keep us a world away from anything beyond. With nooks and tucks and private places for rest, relaxation, reflection, as well as large open spaces for group hangs and entertaining. The layout of the rooms on the second floor, number of beds, and baths worked really well for our group of 19. The first floor, with it's open design and layout in the kitchen area was a lovely place, with plenty of space for everyone to congregate and enjoy sharing meals, food, drinks and laughs. The beautiful large countertops and island were great for throwing down a giant spread of salad and sandwich fixin's for lunch between meetings. And the conference room with the large screen tv and seating were perfectly accommodating for daily meetings and presentations. Even with our large group, there were enough alcoves, seating areas, and other spaces, that it never felt crowded over our four-day stay. AND the decor and embellishments were intriguing enough, tiny little wonderful discoveries were made daily. Like the armor and swords in the sitting room, and the ping-pong trophies in the study. Too many to list, but the ornamentations were far from boring, bold even, yet still tasteful and fun. This is a clean, and well cared for property. It clearly takes a team to keep it that way. Contractors would come in and out periodically for things outside like the pool, perform lawn maintenance, and replenish the propane in the outdoor kitchen areas. They did their work and never bothered us for anything. It was great to have Tony there when we checked in to show us around a bit, and describe how to operate a few unique features at the D&D, like the in-pool-spa, outdoor music, and the dolphin fountain in the main lobby. It was a successful week for our team! And meeting up at the D&D for our company retreat was a great choice!",
      "author": "Stacey",
      "role": "Client"
    },
    {
      "text": "Traveled to Las Vegas with a team of professionals for a modeling and photography shoot. As a makeup artist, I sometimes feel out of place at events like these, but this felt like HOME!! So many beautiful places to shoot, three pools, hot tub, guest house, bath house, poker room, wine cellar with affordable wines, WiFi for multiple areas, Uber was only minutes away to go to the strip, gated security, HUGE kitchen with duplicate everything, even had a chopstick drawer!! The owner was a gracious host, very entertaining and accommodating of disabled, took us on a tour of his other lovely properties, (I can't wait to stay in those!) and was personable and attended to our needs immediately! I cannot wait to go back!! Thank you to Raymond LaPietra from Career Images Model and Talent agency as well as Gary W. for this amazing event! Will definitely be back!!",
      "author": "Jennifer E Sullivan Cassidy",
      "role": "Client"
    },
    {
      "text": "My and my husband just married and had our wedding after gathering at this place with 50 of our friends. We loved the place, and the professional star chef that they have guided us to as their partners for special occasions. All of us had a wonderful time, and we all fit into the biggest kitchen I have ever seen, even on TV. Thanks for the good memories.",
      "author": "Devin Gray",
      "role": "Client"
    },
    {
      "text": "Very professionally done! Our company had our top management meeting and leadership training at the DD mansion, as we wanted to be close yet not on the Strip so we can work well during the day and play hard at night. DD gave us both at their single location. We had good meeting in their large conference room that fit 20 people, and we had so many places for our breakout sessions both in and outside the mansion. The cost per person is amazing with so much amenities at this place, even a 3000 bottle wine cellar, not to mention the 8 water works including 2 pools and 5 kitchens. Our CEO was very happy with me booking this place and I will do it again for our other high level meetings and conference.",
      "author": "Emma Potter",
      "role": "Client"
    },
    {
      "text": "We are so glad that we have choose the DD mansion over strip hotels. Not only all 30 of us fit in without a problem, and the price per person was so much better. Yet that is not what is best about this place: all the fun stuff it has are so amazing. Great two pools, great workout room, such huge kitchen that all 50 of our friends and families all fit in at the same time. We will be so happy to come here for our next family gathering party and fun stay. Thanks a lot, DD. Good memories.",
      "author": "Anonymous",
      "role": "Client"
    },
    {
      "text": "Our movie company is filming a feature movie with a lot of high class party scenes. When we saw the DD mansion, our producer, our director and all of our staff were elated to have such a wonderful place to film and also play. Our actors and actresses are all in awe with this property, all they did was taking great photos of this place to tell their friends on Instagram and Facebook, what a great place they have just filmed at. One has to be here to really believe it. This place as a private mansion is just out this world. When we first walked in, we thought we were at Caesars Places or the Venetian Grand Canal shops areas. What a wonderful place and we will be back with another movie or TV project. All of us just love it. On a scale of 1 to 10, we will give it a 15!!!!",
      "author": "Anonymous",
      "role": "Client"
    }
  ],
  "oo": [
    {
      "text": "This place was perfect for a big group of us. The house is set up to host parties, but it was also great for a bunch of kids too.",
      "author": "Chris",
      "role": "Client"
    },
    {
      "text": "My group and I really enjoyed our stay at James's place. It is beautiful, very spacious, and the pool area was perfect for our large group. James and Brooke were wonderful hosts, very attentive and quick to respond. I would recommend this place to large groups or anyone that is wanting to enjoy all of the amenities this home offers. We hope to stay in one of James' homes on our next Vegas trip.",
      "author": "Mayra",
      "role": "Client"
    },
    {
      "text": "Great for big groups... has everything you could ever want or need. Would highly recommend it!",
      "author": "David",
      "role": "Client"
    },
    {
      "text": "I didn't know what to expect as this was the first time I had ever rented a home through any site. It was nerve racking as I was responsible for housing 23 adults and 6 kids with their ages ranging from 10 weeks to 9 years old. This house was the PERFECT fit for our celebration for our 75 year old grandmother! Everyone who stayed were floored with the place! This could not be done via hotel as there isn't a hotel room big enough for our whole crazy family. If there is, we probably couldn't afford it anyway. The casita worked out well as some of the family members didn't have a bed time lol. Plenty of room to stretch out yet close enough to be in all the action. The pool?? My 9 year old nephew said it best, Am I dreaming? Is this for real? Legit pool and the center of the weekend celebration! Tony and I were always in constant contact with each other and I never felt I couldn't reach him if i needed something. I would highly recommend this property for your next vacation! Keith A. Martinez, Ontario Ca",
      "author": "Tiffani C.",
      "role": "Client"
    },
    {
      "text": "Amazing house, we had a group of 22 people, and everyone had a blast. No complains. Kudos for house.",
      "author": "Pablo",
      "role": "Client"
    },
    {
      "text": "The O&O was exactly as described. It was the perfect house for our needs--spacious, clean, and updated. Tony was an excellent communicator from the moment I inquired about the property. He was very quick to answer all my questions and he was very accommodating. Great experience overall.",
      "author": "Christian",
      "role": "Client"
    },
    {
      "text": "Awesome house. Great for parties.",
      "author": "Alex",
      "role": "Client"
    },
    {
      "text": "This is an awesome location that I found secure and served as a great getaway.",
      "author": "Stanley",
      "role": "Client"
    },
    {
      "text": "Awesome spot for large group.",
      "author": "John",
      "role": "Client"
    },
    {
      "text": "This place is great and James is a big help",
      "author": "Lamar",
      "role": "Client"
    },
    {
      "text": "If you're tired of staying in the hotels and want more of a cozy, homey feeling when traveling away from home, this is the best choice! The best vacation house in LV!",
      "author": "Carol C",
      "role": "Client"
    },
    {
      "text": "The O&O was a perfect house for our group. A great location really close to the strip. It was clean and spacious with all the amenities you'll need. The pool was so nice & relaxing. Great host who quickly and clearly communicates with guests. I highly recommend this place anyone visiting Las Vegas! Thank you Tony!!!",
      "author": "Lulu",
      "role": "Client"
    },
    {
      "text": "You get what you pay for. Tony is always on call to ensure you never have an issue. The mansion was unbelievable. We had so much fun using the pool. Highly recommend renting this place! Ill be back next year!",
      "author": "Kyle",
      "role": "Client"
    },
    {
      "text": "Perfect hous for our needs. Relaxed around the brilliant pool in the day. Grilled on the large bbq and close enough to be easy to get to and from the strip. Tony was an excellent communicator. Would recommend the house and tony to any travellers to vegas.",
      "author": "Bari",
      "role": "Client"
    },
    {
      "text": "Great Stay! The house was amazing. There was plenty of space for all of us, and it worked out great. We used it for a business retreat while at a trade show in Las Vegas. It was perfect. Thank you! (Homeaway Review)",
      "author": "ASHLEY V.",
      "role": "Client"
    }
  ],
  "rr": [
    {
      "text": "Hosted a corporate leadership team retreat for 12 people and this was perfect! The home is immaculate, and the host and team were very responsive.",
      "author": "Andrea",
      "role": "Client"
    },
    {
      "text": "Seriously exceeded my expectations. Which is rare. Perfect house for our company. There were little issues here or there like the water heater going out, but no joke I text brook and 5 min later someone was there and fixed it. Wish the hot tub stayed on 24/7. Had to send a text every time when wanted the hot tub heated. But they were very prompt on doing it. Great place. Will rent again.",
      "author": "Van",
      "role": "Client"
    },
    {
      "text": "The house is spectacular",
      "author": "Jasen",
      "role": "Client"
    },
    {
      "text": "Awesome home and our host Brooke was amazing. I highly recommend this home to anyone looking for a spacious, clean, trendy place to stay. We were very delighted.",
      "author": "Leo",
      "role": "Client"
    },
    {
      "text": "Beautiful house. We used it for a business trip and it was most definitely accommodating. The host is quick at replying and very accommodating to the guests needs. Great experience!",
      "author": "Janeth",
      "role": "Client"
    },
    {
      "text": "This property is a hidden gem a few miles away from the strip and provides you and your guests a welcoming and calming atmosphere. It also has a balanced floor plan of both openness and privacy which I find really refreshing. Also, what other places have you stayed that has a built in karaoke room?! Try this place out, you won't regret it.",
      "author": "Carisa M.",
      "role": "Client"
    },
    {
      "text": "We caught this house during a bizarrely rainy week—and it wasn't built for the rain. Fortunately (and to this we attribute our 5-star review), the team, Brooke specifically, was incredibly attentive, efficient, and quick to remedy any rain-related issues we had. We've probably never had a better experience with Airbnb hospitality. The house itself is very cool and unique—12 bedrooms, almost all of which have direct outdoor access. The pool and hot-tub and sports court and fully-stocked kitchen and giant center island were hits with our group. We were very pleased considering the inconvenient weather. Thanks so much Brooke & team!",
      "author": "Cory",
      "role": "Client"
    },
    {
      "text": "The experience from beginning to end has to be exceptional for me to take the time to write a review. Our experience was exactly that. First, the house. Perfect for large groups. All but one room had it's own bathroom - this is a hard to find and feature and something so helpful when sharing a home. Our party was largely ladies, and last year we were lined up waiting for each person to get our few minutes in. The rooms were spacious and well thought and very comfortable. The bathrooms were all modernized and upgraded. Second, the amenities. The Pool/Jacuzzi, karaoke, observation decks, tennis and basketball courts a wonderful treat. We had all that we needed to enjoy our week right within the confines of our private sanctuary. Third, the hospitality. Attentive to all of our needs. Communication was great throughout. Finally, the vendors: Our Chef - AMAZING. Kelly prepared breakfast two mornings - what a wonderful way to start the day. Kelly (and her crew) prepared a 5 star surf/turf meal for the team on the Friday night and it was absolutely delicious. I highly recommend splurging for this service if you rent this home - it will take your stay to the next level. Kelly prepared, cooked, cleaned - while we got to sit and enjoy each other rather than manically racing to get things done before heading to our various commitments. The Bartending service - Shawn, his wife and crew. We held a house party for our customers. They shopped, delivered and spearheaded everything necessary to deliver a great experience with top shelf goodness. They went above and beyond at every turn and we could not be more thankful. The Cleaning service. LIFE SAVERS. They tailored to our needs and were so incredibly kind, patient and understanding. We honestly could not have done it without them and wish I could carry them home in my bag 🙂 Every person/service James, Will and Brooke recommended were top notch. On a scale of 1 to 10 our entire experience was an 11. Thank you team for all that you did for our team - we will never adequately express our appreciation to each and every person who made our stay memorable.",
      "author": "Kimberly",
      "role": "Client"
    }
  ],
  "ee": [
    {
      "text": "Great place to work and school from home, we had a fabulous time",
      "author": "Kerry",
      "role": "Client"
    },
    {
      "text": "Me and my family stayed at this mansion while out in Vegas for my little brothers 21st birthday, and it was definitely the perfect touch to an experience that we'll never forget. The hosts get back to us quickly and were very flexible. Would definitely recommend this to anyone going to",
      "author": "Dakota",
      "role": "Client"
    },
    {
      "text": "The hosts for this space were absolutely amazing. They were so responsive and allowed us to host our team meeting here as a fun, more unique venue. It was the perfect vibe for what we were going for and a great place to get everyone together. There are a lot more decorations than expected at the space and can be a little crowded, so I would recommend giving yourself ample amount of time to move things around (as they allowed us to) if you're thinking of hosting an event here. It does have a very heavy theme so moving some of the decorations out of the living room helped tone that down a bit, though there are paintings on the walls / outside that you cannot change. But otherwise everything went wonderfully!",
      "author": "Rachael",
      "role": "Client"
    },
    {
      "text": "Perfect place for a large group!!! Everything was amazing especially the pool and amenities that went with the pool.",
      "author": "D.J.",
      "role": "Client"
    },
    {
      "text": "Magical adventure awaits with charm and character",
      "author": "Ceally",
      "role": "Client"
    },
    {
      "text": "This place was great! The amenities were amazing and James was quick to respond.",
      "author": "Ting",
      "role": "Client"
    },
    {
      "text": "Amazing home to spend a summer weekend in vegas! plenty of beds, TV's, waterfall with slide and a lazy river! what more could you ask for!",
      "author": "Bobby",
      "role": "Client"
    },
    {
      "text": "Love this house. Was so much to do... you don't even need to go do the Vegas thing. Ping Pong, Lawn Games, Pop-shot, Pools pools and more pools. Everything was perfect. James and Brooke were right there via text for any questions we had... and everything went off without a hitch. Was a great week and we WILL be back.",
      "author": "Paul",
      "role": "Client"
    },
    {
      "text": "James's place was perfect for my group. I would definitely stay again!",
      "author": "Jamica",
      "role": "Client"
    },
    {
      "text": "Had a great time during our stay with a group of 11 people. Everything was as advertised and would definitely recommend this house for anyone with a group of people looking for an alternative to staying on the strip. Thank you!",
      "author": "Daniel",
      "role": "Client"
    },
    {
      "text": "This space was fantastic, so much room. Communication was on point! Thank you for everything Brooke!! Highly recommend this home!! We will definitely be back!",
      "author": "Stacey",
      "role": "Client"
    },
    {
      "text": "Everything you can ask for in spacious village",
      "author": "Terry",
      "role": "Client"
    },
    {
      "text": "Brooke helped us check in. She had great communication and hospitality. Beautiful home with insane backyard. Would book again!!!",
      "author": "Kiera",
      "role": "Client"
    },
    {
      "text": "My family has been renting vacation homes for 34 years for Thanksgiving and this house did not disappoint! James and his team, especially Brooke, we're fantastic. Extremely responsive and quick to answer any questions we had. The house itself is amazing, especially the backyard! Everything was exactly as pictured which has not always been the case for us. Unfortunately, it was too cold to enjoy it completely, but we used the hot tub a lot!! The kitchen was the best we've ever had for cooking Thanksgiving dinner, equipped with everything we needed. Thank you for everything!",
      "author": "Diane Renu",
      "role": "Client"
    },
    {
      "text": "Truly amazing place to stay. I am ready to sell everything & move here. Haha. We had a big group, 26 people, and everyone agrees, this house is over the top. If you are considering it, book it!",
      "author": "Jered",
      "role": "Client"
    },
    {
      "text": "The house looked even better in person! Brooke was very nice and helpful, would definitely book again!",
      "author": "Calvin",
      "role": "Client"
    },
    {
      "text": "Great place, backyard is amazing.",
      "author": "Darren",
      "role": "Client"
    },
    {
      "text": "Place was perfect and brooke was great tended to all of our needs",
      "author": "Robert",
      "role": "Client"
    },
    {
      "text": "You won't be disappointed!!!",
      "author": "Matthew",
      "role": "Client"
    },
    {
      "text": "This house was amazing! We had a joint bachelor party and it was the perfect place to relax!",
      "author": "Cody",
      "role": "Client"
    }
  ],
  "cc": [
    {
      "text": "Really great place to stay! We had a large group of 40 people and there was enough beds to accommodate us all. Most airbnbs we had researched only have enough beds for ~20 people so this place was perfect. It is a pricier than your average airbnb, but you're paying for all the great amenities that come with the house (pool, jacuzzi, large shared spaces, garage games, etc). The rooms felt bigger than the pictures. They really have everything covered for you. Communication-wise, James was very quick to respond with any question I had before arrival. Check-In was very easy. You're provided a code for the gate and door, but Brooke was there in-person to check us in and give a tour of the property. Anytime we needed the jacuzzi turned on (which was via text with Brooke) she responded immediately every time. Overall, would recommend this place for large groups. With all the amenities, we really didn't have to leave the house. Also, it's fairly close to the strip so uber/lyft was not too bad.",
      "author": "Francine",
      "role": "Client"
    },
    {
      "text": "The pool and outdoor spaces at this place is next level! Two huge kitchens and enough space to feed a small army. The bathrooms are state of the art and there is a huge tv in each room with premium cable. We had the pleasure to work with Brooke as a host, she was very helpful, responsive, and a delight to work with. This place did not disappoint. $12-15 uber to the strip $5 uber to the grocery store Cool parks close by legal to drone at!",
      "author": "Mitch",
      "role": "Client"
    },
    {
      "text": "Outstanding ! James and his assistant Brooke were awesome!",
      "author": "Tim",
      "role": "Client"
    },
    {
      "text": "Expect nothing less than the best. Very hospitable and very responsive to needs. Will stay again.",
      "author": "Marlene",
      "role": "Client"
    },
    {
      "text": "Beautiful home! They definitely took care of us. The pictures do no do it any justice, looks even better in person! Would definitely recommend for anyone who wants to stay off the strip!",
      "author": "Andrew",
      "role": "Client"
    },
    {
      "text": "One of the best Airbnb I've ever stayed in by far! This place is so awesome and sparkling clean. We had an amazing time and the host were perfect.",
      "author": "Jason",
      "role": "Client"
    },
    {
      "text": "This House is not only fun, but huge! A great place for family or friends to stay. you feel at home, beds are comfy rooms are spacious we cooked a huge breakfast for the 16 of us everything we needs was there and in great condition. Outside space is great for the kids or adult (Website hidden by Airbnb) working with the Host was such a pleasure you feel as if you are number 1 We would book with them again 100%",
      "author": "Danielle",
      "role": "Client"
    },
    {
      "text": "An amazing spot. Not underselling it at all. I usually dont write reviews (positive or negative), but would highly recommend this place. Host was great and the house is clean, well set up, and perfect for a group. Not on the strip, but not far either.",
      "author": "Michael",
      "role": "Client"
    },
    {
      "text": "Very friendly host. Awesome place to have a lot of friends. Great rooms fun pool and entertainment. Definitely recommend it.",
      "author": "Sam",
      "role": "Client"
    }
  ],
  "uu": [
    {
      "text": "We booked this property to celebrate my sons graduation from law school and it was perfect for our family. We had 16 people ages from two years old to 90 years old and it met everyone's needs. It was very clean inside and out. The pool area was awesome. We had a lot of fun.",
      "author": "Liz",
      "role": "Client"
    },
    {
      "text": "Lyn's place is beautiful large. We loved staying there and will be bcak for sure. It's probably my favorite AirBNB that I've stayed at in Las Vegas. 👍🏼",
      "author": "Daniel",
      "role": "Client"
    },
    {
      "text": "Ventured to Vegas for 4-days, this was phase II of our bachelor party... With location, comfort, safety and amenities in check, this property was a retreat, our group was free to write memories we'll never forget. Ease of check-in/check-out, full communication, areas to disperse and relax, game rooms, stereo, TVs, pool, spa, waterfall, BBQ's, all the trinkets to feel comfortable chilling at home. But when the times comes, minutes to the strip and DT, and only minutes back. Highly recommended for others to enjoy, everyone in our group would return.",
      "author": "Joshua B.",
      "role": "Client"
    },
    {
      "text": "It's a beautiful property. The art that adorns the house was very thoughtful and must have have been completed by someone who is extremely talented. Brooke was very committed to answering our questions. The pool is amazing. 5 stars!",
      "author": "Chris S.",
      "role": "Client"
    },
    {
      "text": "Very nice property with plenty of rooms and space and a great pool / hot tub. Excellent for large groups. The Karaoke room is also a huge bonus.",
      "author": "Jeffrey M.",
      "role": "Client"
    },
    {
      "text": "Had a fantastic time at the house! Lots of room, plenty of amenities in bedrooms, bathrooms, kitchen, pool! Its was the memorable & unique experience we hoped for! Could use a pool table though.",
      "author": "Terry W.",
      "role": "Client"
    },
    {
      "text": "I'll come back to this house for sure whenever I go to Las Vegas.",
      "author": "Richard N.",
      "role": "Client"
    },
    {
      "text": "You won't be disappointed.",
      "author": "Charles F.",
      "role": "Client"
    },
    {
      "text": "Great for entertaining! Excellent attention to detail with upgrade. Immediate property management response when needed. Would stay again!",
      "author": "Scott E.",
      "role": "Client"
    },
    {
      "text": "Everyone enjoyed it.",
      "author": "George L.",
      "role": "Client"
    },
    {
      "text": "Very friendly and responsive host. Perfect location. Excellent house for a large group. Thank you.",
      "author": "Kris",
      "role": "Client"
    },
    {
      "text": "We had the loveliest stay! The pool setup is incredible. Even in a heatwave, the pool was cool and always had shady spots to enjoy the day from throughout. The waterslide is so much fun! Big kitchen, great for families or larger groups who like to cook meals together and dine in. Our group loves to karaoke together, so the karaoke room was a dream come true. Such fun! All around, we had a terrific time and hope to come back again in the future!",
      "author": "Chanel",
      "role": "Client"
    },
    {
      "text": "Amazing",
      "author": "Quentin",
      "role": "Client"
    },
    {
      "text": "We stayed here recently for a family reunion. Lyn and Brooke were excellent hosts. Brooke did a fantastic job welcoming us and going over the different areas of the house. The house itself is gorgeous and looks just like the photos. THE HOUSE IS A WORK OF ART! All of the paintings on the walls are hand-painted and I found myself just admiring all the details in every room. The house was spacious and comfortable, and the amenities were fantastic. Pool, hot tub, playhouse, BBQ, arcade games, game room, laundry, the list goes on. This was perfect, serene, and private for our group and also perfect for our young children. We would definitely book again!",
      "author": "Helen",
      "role": "Client"
    },
    {
      "text": "Me and my basketball team stayed here and it was enough space to accommodate us all. The amenities were great and keep the guys entertained. Brooke was responsive to any questions and issues we had. The home is close enough to the strip and airport, yet far enough to get away from the hustle and bustle of the strip. If you have a large group and you're planning on visiting Vegas, this is a great home to stay in. If I ever need a place for a big group, I would definitely stay here again! 5 out of 5 stars.",
      "author": "Jeff",
      "role": "Client"
    },
    {
      "text": "This location is great for large groups. The pool and karaoke/game room provide endless fun.",
      "author": "Laura",
      "role": "Client"
    },
    {
      "text": "All around a gorgeous place. Looks exactly like the pictures show. Usually when renting large homes, we always run into pool issues or several repairs needing to be done and this place was perfect. Zero issues and absolutely beautiful. This is our second time renting with Lyn and we will happily rent again.",
      "author": "Tiffani",
      "role": "Client"
    },
    {
      "text": "Thank you so much!!! Our family had a wonderful time. You guys thought of pretty much everything. This home was perfect for us! Happy New Year!!!",
      "author": "K'Lynn",
      "role": "Client"
    },
    {
      "text": "The house was amazing. The pool is awesome! The game room was great. The only thing missing was the fitness room. Overall this house is beautiful. It was calming and peaceful with plenty of good vibes. I would recommend this to anyone that is looking for relaxation. Shout out to Brooke for being an awesome host!",
      "author": "Nikki",
      "role": "Client"
    },
    {
      "text": "What an AMAZING time! The pool is exceptional and there are people who come to clean it daily. I got catering through their recommended caterer Kelly and she is FAB! She did a mimosa bar for my friends and I every morning a long with a beautiful lunch and breakfast. The house itself is more than I expected and the master bedroom is a dream. The decor throughout is unique and peaceful. There are weights to workout and a game room. It felt like home and it's 10-15 minutes away from the strip!",
      "author": "Kessie",
      "role": "Client"
    },
    {
      "text": "Brooke is amazing and has a very quick response time. The house is very beautiful and the photos don't do it justice! Great for a family vaca or with friend get away!",
      "author": "Twannee",
      "role": "Client"
    },
    {
      "text": "What an amazing home. Perfect for my weekend in vegas! Lyn replied within minutes to any inquiry we had. Thank you Lyn!",
      "author": "Nigel",
      "role": "Client"
    },
    {
      "text": "Stunning place, stunning team, absolutely beautiful place... definitely 2x⭐️⭐️⭐️⭐️⭐️!!! Prepare to be amazed, there is so much going on with this place, you'll have to reserve it for a whole week to get through all of it... highly recommended!!! Don't take my word for it, experience it for yourself. The pictures do it no justice! Annnnd the house tells a story... Hats off to Ms. Lyn. I Definitely will be back!",
      "author": "Gary",
      "role": "Client"
    },
    {
      "text": "Great place to stay for a family or large party who want to go out at night or a quiet place to stay in the evenings. Very close to HUNDREDS of great Japanese, Korean, Chinese, Vietnamese, and Thai restaurants.",
      "author": "John",
      "role": "Client"
    },
    {
      "text": "Place was very clean. Beds were insanely comfortable. Kitchen was nice. 4 fridges (2 kitchen, 1 in the laundry room, 1 in the garage) Cook accessories weren't great, but we were able to make several meals there. Pool was the star of the show. Very large, could fix at least a 12 people comfortably. Hot tub with the waterfall, very chill vibes. Water slide was short, but actually a ton of fun. There was a floating pong table, always a blast. Lots of towels. Laundry to do the tools on the main floor with an entrance from the pool area. Also an entranced to get to the detached garage. Garage was perfect for beer games, ping pong table and fridge. Also had a handful of other table tables. It's like 3 miles or 10 mile drive to the strip. Ubers for us at the time were like $20-25 each way. Perfect house for a chill bachelor party, everyone loved it.",
      "author": "Andrew",
      "role": "Client"
    },
    {
      "text": "This property didn't fall short by any means! Everything was as advertised and Brooke was awesome! We would definitely stay again!",
      "author": "Latoya B.",
      "role": "Client"
    },
    {
      "text": "This property is an oasis in the desert. You really could book here, hire the private chef and never leave. The pool is amazing and with 8 bedrooms and 8 full baths it's truly incredible with a tremendous amount of space. We would definitely stay here again.",
      "author": "Shane C.",
      "role": "Client"
    },
    {
      "text": "Had an amazing time with 16 celebrating 3 lovely ladies 50th birthdays. Brooke was more than accommodating and responsive to our needs. We had a catered dinner the night of the party. The set up and property was perfect! A fantastic time was had by all! The only issue we had was the lack of serveware, dishes, glasses and the like. We had to purchase disposable pans for backing. For a home that accommodates a large group, that should be remedied. Other than that it was perfect!",
      "author": "Autumn E.",
      "role": "Client"
    },
    {
      "text": "Perfect property for our group of 8",
      "author": "Dave M.",
      "role": "Client"
    },
    {
      "text": "It was just like the picture love this property very clean Place to stay I will stay here again.",
      "author": "Erica H.",
      "role": "Client"
    },
    {
      "text": "Very nice property would recommend!.",
      "author": "Jason M.",
      "role": "Client"
    },
    {
      "text": "Great property for our group. Hosted 11 of us for fantasy football weekend. Plenty of space. Outdoor area was perfect. Plenty of standard amenities(kitchenwares, utensils, towels, etc). Honestly had nothing to complain about and had no issues during our stay. If we come back to Vegas again I'd definitely book one of Lyn's properties. Also had a chef available if we wanted, we didn't but a nice option.",
      "author": "Andy",
      "role": "Client"
    },
    {
      "text": "My group and I had a really enjoyable time staying at Lyn's place! It was super easy to find the location and it was very spacious. The pool and hot tub were fantastic during our stay. Beds and sofas were comfy. Plenty of parking and easy check in! Brooke was very responsive before and during our stay. There was plenty of room for my group to hang out and chat in the house. There was also a lot of great food available for delivery around the location. Would recommend staying and am down to check out their other locations! Couple things to note - due to the number of people showering we did run out of hot water if we showered at the same time but if we were mindful of it it was fine. Also, would bring house slippers!",
      "author": "William",
      "role": "Client"
    },
    {
      "text": "Great place for a group, a quick Uber from the strip, and awesome pool and yard. Lyn was very accommodating and responsive and made us feel secure and in good hands when our other rental booking was cancelled last minute.",
      "author": "Alex",
      "role": "Client"
    },
    {
      "text": "Lyns place was amazing. We had a great time with family's and really enjoyed all the accommodations in the home.",
      "author": "Sonia",
      "role": "Client"
    },
    {
      "text": "Wonderful accommodations, we all enjoyed our stay there. The communication was outstanding and the home itself was extremely cared for. I would highly recommend this property!",
      "author": "Anthony",
      "role": "Client"
    },
    {
      "text": "This is a great place to stay for a big group especially a family reunion. Lots of space and things to do for different ages.",
      "author": "Charles",
      "role": "Client"
    },
    {
      "text": "Great place, beautiful home.",
      "author": "Danny",
      "role": "Client"
    },
    {
      "text": "Everyone was super impressed with the house. Highly recommended! We had 16 people and all were comfortable.",
      "author": "Jordan",
      "role": "Client"
    },
    {
      "text": "Great place. Fun for big groups. Highly recommend!",
      "author": "Alex",
      "role": "Client"
    },
    {
      "text": "Awesome property so relaxing and close to the strip definitely would recommend and would return.",
      "author": "Adan",
      "role": "Client"
    },
    {
      "text": "A property worth renting that will accommodate at least 14 adults.",
      "author": "John(Jack)",
      "role": "Client"
    },
    {
      "text": "Beautiful home, very clean and an outstanding staff. The location is outstanding!",
      "author": "Timothy",
      "role": "Client"
    },
    {
      "text": "Great home! Has all the amenities you would want in a vacation home. The home is located in a residential area so keep that in mind if you plan on having a large group. Other than that, great location and excellent service.",
      "author": "Roxana",
      "role": "Client"
    },
    {
      "text": "Brooke did a wonderful job answering my request. The house was as exact from the pictures. If I'm ever in Vegas again, I'd definitely do the Utopia Mansion again.",
      "author": "Twannee",
      "role": "Client"
    },
    {
      "text": "This venue is truly amazing!! It was so close to the strip and the airport. There are plenty of great food choices near by. The house itself is just loaded with things to do! The backyard was my absolute favorite place to hang! Wonderfully private for you and your guess. Will return to this property in the future. Brooke was the best host we appreciate her so much! Highly recommended location!",
      "author": "Jackie",
      "role": "Client"
    }
  ]
}